[
{"title": "Clustering and visualization of Lithium-Ion battery data for second life applications", "url": "https://upcommons.upc.edu/handle/2117/394821", "author": "Domínguez Piernas, Gabriel", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "L'ús de bateries de segona vida és una de les estratègies més prometedores per a resoldre el problema del reciclatge de piles en el futur. L'objectiu d'aquesta recerca és aportar solucions pràctiques de garbellat, reagrupació ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.9528241157531738, "description": "L'ús de bateries de segona vida és una de les estratègies més prometedores per a resoldre el problema del reciclatge de piles en el futur. L'objectiu d'aquesta recerca és aportar solucions pràctiques de garbellat, reagrupació i reutilització donant un nou ús a les piles de liti retirades. Donar una segona oportunitat a aquestes bateries retirades no sols té beneficis ecològics i mediambientals, sinó que també és rendible des del punt de vista econòmic. Per a aquest projecte, s'ha aprofitat el conjunt de dades que va registrar la NASA per a observar el comportament de les bateries elèctriques d'ió-liti al llarg de la seva vida per a realitzar un estudi que permet predir la vida útil d'una bateria. Mitjançant diferents tècniques d'aprenentatge automàtic, principalment SVM, s'ha aconseguit entrenar un model que pugui predir aquesta característica. D'aquesta manera es pretén aportar en un camp on la sostenibilitat i l'economia circular són cada vegada més importants. En el futur, es podrien implementar estratègies basades en l'ús de bateries de segona vida en diferents sectors, des de l'emmagatzematge d'energia fins a la mobilitat elèctrica. Realitzant aquest projecte es pretén continuar pel camí de la recerca a partir de tècniques de ML i IA per a contribuir a una economia més sostenible i responsable. The use of second life batteries is one of the most promising strategies to solve the problem of battery recycling in the future. The objective of this research is to provide practical solutions of screening, regrouping and reuse by giving a new use to retired lithium batteries. Giving a second chance to these retired batteries not only has ecological and environmental benefits, but is also cost-effective from an economic point of view. For this project, the data set recorded by NASA to observe the behavior of lithium-ion electric batteries over their lifetime has been used to conduct a study to predict the lifetime of a battery. Using different machine learning techniques, mainly SVM, it has been possible to train a model that can predict this characteristic. In this way, it aims to contribute to a field where sustainability and circular economy are becoming increasingly important. In the future, strategies based on the use of second life batteries could be implemented in different sectors, from energy storage to electric mobility. This project aims to continue on the path of research based on ML and AI techniques to contribute to a more sustainable and responsible economy.", "keywords": "Artificial intelligence Machine learning Lithium ion batteries--Recycling Intel·ligència artificial Aprenentatge automàtic Bateries d'ió liti--Reciclatge"},
{"title": "Creación de una web común para los refugios de animales", "url": "https://upcommons.upc.edu/handle/2117/394808", "author": "Sanecki, Dawid Aleksander", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "El proyecto \"Creación de una web común para los refugios de animales\" es un proyecto del fin de grado de ingeniería informática, de la especialidad de la ingeniería del software, para la Facultad de Informática de Barcelona ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.1041910648345947, "description": "El proyecto \"Creación de una web común para los refugios de animales\" es un proyecto del fin de grado de ingeniería informática, de la especialidad de la ingeniería del software, para la Facultad de Informática de Barcelona (FIB). El proyecto fue desarrollado de forma individual, con supervisión y ayuda del director del proyecto, y también guiado en parte por el profesorado del GEP. El trabajo consistió en la creación de una web común para los refugios de animales, se trataba de crear un sistema al que puede acceder cualquier refugio de animales en el cual pueden publicar sus animales en la web para darles más visibilidad y facilitar el rescate de los animales. Se emplea un stack muy parecido al MERN: React JS + Node JS + Express JS Y en lugar de usar MongoDB, se emplea MariaDB. The project \"Creación de una web común para los refugios de animales\" is a project for the end of the degree in computer engineering, specialising in software engineering, for the engineering, for the Faculty of Computer Science of Barcelona (FIB). The The project was developed individually, with supervision and help from the project project director, and also guided in part by the GEP teaching staff. It consisted in the creation of a common website for animal shelters. The idea was to create a system that can be accessed by any animal shelter where they can publish their which they can publish their animals on the web to give them more visibility and facilitate the rescue of animals. visibility and facilitate the rescue of the animals. MERN-like stack is used: React JS + Node JS + Express JS And instead of using MongoDB, MariaDB is used.", "keywords": "Web applications Web sites--Design Databases Aplicacions web Pàgines web -- Disseny Bases de dades"},
{"title": "Automated code translation", "url": "https://upcommons.upc.edu/handle/2117/394840", "author": "Cano Cañardo, David", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Restricted access - confidentiality agreement", "abstract": "L'objectiu general d'aquest treball és realitzar un estudi sobre com poder migrar, de manera eficient, codis escrits en Java cap a Kotlin. S'han valorat les opcions que es tenen avui en dia i s'ha plantejat una nova solució, ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.121371030807495, "description": "L'objectiu general d'aquest treball és realitzar un estudi sobre com poder migrar, de manera eficient, codis escrits en Java cap a Kotlin. S'han valorat les opcions que es tenen avui en dia i s'ha plantejat una nova solució, l'ús dels Large Language Models. The objective of this thesis is to study how we can efficiently migrate Java codes to Kotlin. The various options that exist today have been evaluated and a new solution has been proposed, the use of Large Language Models.", "keywords": "Java (Computer program language) Kotlin (Computer program language) Java (Llenguatge de programació)"},
{"title": "Desenvolupament d'un conjunt d'eines auxiliars per a un programari de gestió de laboratori", "url": "https://upcommons.upc.edu/handle/2117/394806", "author": "Fernández Clemente, Irene", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Les empreses farmacèutiques empren una classe de software anomenada LIMS, o Laboratory Information Management System, per gestionar els procediments de laboratori que realitzen. Kymos, l'empresa on es realitza aquest ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.11889386177063, "description": "Les empreses farmacèutiques empren una classe de software anomenada LIMS, o Laboratory Information Management System, per gestionar els procediments de laboratori que realitzen. Kymos, l'empresa on es realitza aquest projecte, empra LabWare LIMS. El programari permet la creació de noves pantalles i procediments per a ajustar el seu funcionament a les particularitats de cada empresa. Aquest projecte conté el desenvolupament de les següents millores als sistemes informàtics de Kymos: - Millora Interfície de Balances: Kymos empra una interfície web de control de balances que permet la captura de mesures i la introducció dels resultats a les bases de dades, desenvolupada prèviament. Aquesta, però, té problemes greus de funcionalitat, que s'han adreçat en aquest projecte. - Pantalles KPIs: Els KPIs (Key Performance Indicators) són molt útils per a les empreses per diagnosticar la seva situació actual i comparar-la amb el passat. En aquest projecte s'han desenvolupat dues pantalles dins de LIMS de KPIs relevants. - Substàncies Controlades: Actualment Kymos treballa amb substàncies classificades com a controlades (com ara narcòtics). Tot i que aquestes substàncies requereixen de consideracions especials els sistemes digitals de l'empresa són completament cecs a l'estat controlat o no d'un producte. En el desenvolupament d'aquest projectes s'ha modificat el sistema LIMS per a abarcar aquesta consideració. - Pantalla d'Incubadors: Un procediment estàndard a Kymos és introduir plaques de productes a aparells incubadors i comprovar-ne el contingut víric passat un nombre d'hores determinat. Fins ara, aquest procediment es gestionava escrivint a llibretes amb els inconvenients que això comporta, i es va demanar digitalitzar-ho. Al tractar-se d'una empresa farmacèutica els canvis informàtics desenvolupats s'ajusten a un conjunt de regulacions específiques (GMP i GLP) i requereixen d'un procediment de validació extens. Pharmaceutical companies use a type of software called LIMS, or Laboratory Information Management System, to manage their laboratory procedures. Kymos, the company where this project is being carried out, uses LabWare LIMS. The software allows the creation of new screens and procedures to tailor its operation to the specific needs of each company. This project includes the development of the following improvements to Kymos' computer systems: - Balance Interface Improvement: Kymos uses a web interface for balance control that allows the capture of measurements and the input of results into databases, previously developed. However, this interface has serious functionality issues that have been addressed in this project. - KPI Screens: Key Performance Indicators (KPIs) are very useful for companies to diagnose their current situation and compare it with the past. In this project, two screens with relevant KPIs have been developed within LIMS. - Controlled Substances: Currently, Kymos works with substances classified as controlled (such as narcotics). Although these substances require special considerations, the company's digital systems are completely unaware of whether a product is controlled or not. In the development of this project, the LIMS system has been modified to encompass this consideration. - Incubator Screen: A standard procedure at Kymos is to place product plates in incubation devices and check for viral content after a certain number of hours. Until now, this procedure was managed by writing in notebooks, which had its drawbacks, so it was requested to digitize it. Being a pharmaceutical company, the developed computer changes comply with a set of specific regulations (GMP and GLP) and require an extensive validation process.", "keywords": "Pharmaceutical industry Enterprise Resource Planning Management information systems Indústria farmacèutica Sistemes d'informació per a la gestió"},
{"title": "Systematic Literature Review Support (GESSI-SLR)", "url": "https://upcommons.upc.edu/handle/2117/394823", "author": "Aumatell Grabolosa, Adrià", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "GESSI-SLR és una web app impulsada pel grup d'investigació GESSI que té per objectiu agilitzar els SLR (Systematic Literature Reviews). L'objectiu d'aquest projecte era millorar aquesta aplicació afegint-hi noves funcionalitats. ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.1191229820251465, "description": "GESSI-SLR és una web app impulsada pel grup d'investigació GESSI que té per objectiu agilitzar els SLR (Systematic Literature Reviews). L'objectiu d'aquest projecte era millorar aquesta aplicació afegint-hi noves funcionalitats. Els canvis més destacats són el disseny del frontend amb Angular, la incorporació de la gestió d'usuaris i el control d'accés, l'ampliació de les opcions de classificació i consens i la personalització de la llibreria JBibtex per tal de solucionar alguns errors que tenia l'aplicació de partida. GESSI-SLR is a web app for the GESSI research group that aims to speed up SLR (Systematic Literature Review) projects. The main goal of this project was to improve the application by adding new functionalities. The most notable changes are frontend design with Angular, user management and access control, the expansion of classification options and consensus and the customization of the JBibtex library in order to fix some bugs the application had before this project took place.", "keywords": "Web application Databases Aplicacions web Bases de dades"},
{"title": "Traffic Analysis of Quantum Computing Algorithms Mapped in Multicore Architectures", "url": "https://upcommons.upc.edu/handle/2117/394822", "author": "López Agudo, Isaac", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Els processadors quàntics multicores són possiblement la millor solució al problema de l'escalabilitat que afronta la Computació Quàntica més enllà de l'era NISQ. Basant-se en la interconnexió de petits xips formats per ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.1221697330474854, "description": "Els processadors quàntics multicores són possiblement la millor solució al problema de l'escalabilitat que afronta la Computació Quàntica més enllà de l'era NISQ. Basant-se en la interconnexió de petits xips formats per desenes o centenars de qubits via una intranet quàntica. Aquest treball per tant busca contribuir modelant aquestes xarxes de xips i estudiar-la en profunditat per obtenir les primeres indicacions per el futur diseny d'arquitectures multicore i compiladors eficients en aquest nou paradigma. Analitzem el tràfic en aquesta xarxa de processadors quàntics basant-nos en diferents mètriques de comunicació, computació i espaciotemporals per qubits i cores que ens permetran caracteritzar el comportament de diferents aplicacions. Quantum multi-core processors are envisioned as the ultimate solution for the scalability of Quantum Computing beyond the NISQ era. Based upon interconnecting ten to hundred qubit chips via a quantum intranet. This work main goal is to contribute into the guidelines to design multicore architectures and developing eficient compilers for this new multicore paradigm by modeling and studying this on chip network for a set of aplications. We analyze the traffic of the network based on performance metrics divided into computing metrics, communication metrics and spatio-temporal metrics for both qubits and cores that characterize the behaviour of the overall execution of algorithms.", "keywords": "Quantum computing Computació quàntica"},
{"title": "A Radial Basis Function Neural Network using biologically plausible activation functions", "url": "https://upcommons.upc.edu/handle/2117/394825", "author": "Tarrés Ribalta, Albert", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Este proyecto se centra en el diseño, la implementación y la evaluación de Redes Neuronales de Función de Base Radial (RBFNN), comparando el modelo gaussiano con una nueva versión que utiliza la función de activación Ricker. ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 2.2706410884857178, "description": "Este proyecto se centra en el diseño, la implementación y la evaluación de Redes Neuronales de Función de Base Radial (RBFNN), comparando el modelo gaussiano con una nueva versión que utiliza la función de activación Ricker. La forma de esta función ha sido observada en las señales de neuronas de distintas partes del cerebro humano, a menudo produciendo una señal negativa (inhibitoria) conocida como inhibición lateral. Se han desarrollado dos modelos de RBFNN, incorporando técnicas de Machine Learning (ML) y estadística como la regularización L2 y el algoritmo sigest para mejorar su rendimiento. También se implementan técnicas adicionales, como la estimación de un parámetro k sobredimensionado y la AIC backward selection, para mejorar la eficiencia. En este estudio, los modelos desarrollados se prueban con conjuntos de datos de diferente naturaleza, evaluando su rendimiento con datos sintéticos y realistas, y midiendo sus resultados con problemas de varios niveles de ruido y dificultad. Además, también se realiza una comparación de los modelos para observar qué RBFNN funciona mejor en determinadas condiciones, así como para analizar la diferencia en el número de neuronas y el parámetro de suavizado estimado. La evaluación experimental confirma la eficacia de los modelos RBFNN, proporcionando estimaciones precisas y demostrando su adaptabilidad con problemas de dificultad variable. El análisis comparativo revela que el modelo Ricker tiende a exhibir un rendimiento superior en presencia de altos niveles de ruido, mientras que ambos modelos tienen un rendimiento similar en condiciones de bajo ruido. Estos resultados sugieren la potencial influencia de la inhibición lateral, que podría ser explorada en más profundidad en futuros estudios. This project focuses on the design, implementation and evaluation of Radial Basis Function Neural Networks (RBFNN), comparing the gaussian model with a new version using the Ricker Wavelet activation function. The shape of this wavelet has been observed in the signals of neurons from different parts of the human brain, often producing a negative (inhibitory) signal known as lateral inhibition. Two RBFNN models have been developed, incorporating Machine Learning (ML) and statistical techniques such as L2 regularization and the sigest algorithm for improved performance. Additional techniques, such as estimating an oversized k parameter and using AIC backward selection, are implemented to enhance efficiency. In this study, the developed models are tested with datasets of different nature, evaluating their performance with synthetic and realistic data and measuring their results with problems of various levels of noise and difficulty. Furthermore, a comparison of the models is also made in order to observe which RBFNN performs better on certain conditions, as well as to analyze the difference in the number of neurons and the estimated smoothing parameter. The experimental evaluation confirms the effectiveness of the RBFNN models, yielding accurate estimations and demonstrating their adaptability to problems of varying difficulty. Comparative analysis reveals that the Ricker model tends to exhibit superior performance in the presence of high levels of noise, while both models perform similarly under low noise conditions. These results suggest the potential influence of lateral inhibition, which could be explored further in future studies.", "keywords": "Neural networks (Computer science) Xarxes neuronals (Informàtica)"},
{"title": "Desenvolupament d'Algoritmes de Machine Learning aplicats a la indústria", "url": "https://upcommons.upc.edu/handle/2117/394807", "author": "Fibla Figuerola, Ignasi", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Restricted access - confidentiality agreement", "abstract": "En aquesta memòria es presenten totes les anàlisis resultants del treball dut a terme en el meu treball final de grau en el marc de la col·laboració entre l'inLab FIB i KaptureIO, per millorar l'eficiència i la qualitat ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.294508934020996, "description": "En aquesta memòria es presenten totes les anàlisis resultants del treball dut a terme en el meu treball final de grau en el marc de la col·laboració entre l'inLab FIB i KaptureIO, per millorar l'eficiència i la qualitat en línies de producció de les Indústries 4.0. Actualment, es realitza un control de qualitat a partir de la combinació de dos mètodes ben diferenciats. Per començar, s'executa un control de toleràncies en les quals, a partir de la mesura de múltiples punts en el vehicle, es detecten possibles errates en el procés productiu. Tot seguit, si es detecta alguna errata, es du a terme una parada en la línia i s'elabora una anàlisi manual, el qual permetrà concloure les modificacions a dur a terme. En aquest projecte s'han analitzat les diferents variables que intervenen en el control de qualitat, buscant desenvolupar algorismes capaços d'anticipar-se a les possibles futures errates. A partir de la implementació d'algorismes d'aprenentatge automàtic s'ha assolit l'anticipació, virtualment, del 71.4% d'errates. Així doncs, els resultats d'aquest projecte suposen un pas endavant en la millora de l'eficiència i la qualitat en les línies de producció, gràcies al fet que es detecten amb anticipació les possibles errates o desviacions en la fabricació dels vehicles. Finalment, gràcies als resultats assolits, l'empresa vol continuar col·laborant amb nosaltres amb objectius més ambiciosos. This report presents all the analyzes resulting from the work carried out in my final degree work in the framework of the collaboration between the inLab FIB and KaptureIO, to improve the efficiency and quality in production lines of Industries 4.0. Currently, quality control is carried out using a combination of two distinct ways. To begin, a tolerance control is performed in which probable mistakes in the manufacturing process are recognized based on measurements of several points on the vehicle. If a mistake is identified, the line is stopped and a manual analysis is performed, allowing the alterations to be carried out to be completed. In this study, the various variables involved in quality control were examined in order to develop algorithms capable of anticipating potential future faults. Based on the application of machine learning techniques, a virtual prediction of 71.4% of mistakes has been obtained. As a result, the outcomes of this study constitute a step forward in improving efficiency and quality in production lines, because potential errors or deviations in car manufacturing are spotted in advance. Finally, as a result of the achievements obtained, the company want to continue partnering with us on more ambitious aims.", "keywords": "Big data Information visualization Machine learning Dades massives Visualització de la informació Aprenentatge automàtic"},
{"title": "IMP-BLAST : Desenvolupament i Integració d'un Traductor Bidireccional entre SQL i Lògica de Primer Ordre", "url": "https://upcommons.upc.edu/handle/2117/394824", "author": "Juanola Ametller, Martí", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "SQL és el principal llenguatge utilitzat per consultar i interactuar amb dades de bases de dades relacionals. Tot i això, SQL no permet raonar sobre les consultes tal com es pot fer des del càlcul relacional, que permet ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 3.3362669944763184, "description": "SQL és el principal llenguatge utilitzat per consultar i interactuar amb dades de bases de dades relacionals. Tot i això, SQL no permet raonar sobre les consultes tal com es pot fer des del càlcul relacional, que permet expressar consultes sobre el model relacional directament amb lògica de primer ordre. Gràcies a l'equivalència d'expressivitat entre l'àlgebra relacional i el càlcul relacional, però, es poden fer traduccions d'expressions entre SQL i lògica de primer ordre. Això és molt útil perquè permet raonar sobre consultes SQL sense haver de dependre dels matisos sintàctics de les seves implementacions. En aquesta tesi es presenta IMP-BLAST, un traductor automàtic i bidireccional entre expressions d'SQL i lògica de primer ordre. El traductor compta amb dues estratègies de traducció diferents i es centren concretament a poder expressar assercions SQL com a restriccions lògiques i viceversa. També forma part del projecte l'especificació d'un metamodel d'SQL estàndard, necessari per al traductor, i la seva implementació amb l'eina IMP-SQL. Finalment, i per demostrar el valor de les eines desenvolupades s'han integrat amb l'eina de comprovació incremental d'assercions SQL TINTIN, substituint les traduccions antigues per les ofertes per IMP-BLAST. SQL is the main language used to query data in relational databases and interact with them. However, languages like relational calculus are far superior at reasoning and interacting with relational queries due to the proximity with first order logic. Thanks to the equivalence in expression power between relational algebra and relational calculus, expressions can be translated between SQL and first-order logic. This is very useful as it allows you to reason about SQL queries without having to depend on the nuances of their implementations. This thesis presents IMP-BLAST, an automatic and bidirectional translator between SQL expressions and first-order logic. The translator has two different translation strategies and they focus specifically on mapping SQL assertions as logical constraints and vice versa. The specification of a standard SQL metamodel is also included in the project since it is needed by the translator. Its implementation, the IMP-SQL tool, is also documented. Finally, and to demonstrate the value of the developed tools, both have been integrated with the incremental integrity checking tool over SQL assertions TINTIN, replacing the old translations with the ones offered by IMP-BLAST.", "keywords": "SQL (Computer program language) First-order logic Databases SQL (Llenguatge de programació) Lògica de primer ordre Bases de dades"},
{"title": "Desenvolupament de l'aplicació Corre-Fulles per incentivar l'interès per la flora de zones verdes", "url": "https://upcommons.upc.edu/handle/2117/394837", "author": "Garrapucho Lévy, Daniel", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "El document explica el desenvolupament d'un projecte de Treball Final de Grau, al Grau en Enginyeria Informàtica de la Universitat Politècnica de Catalunya. El projecte era, principalment, el desenvolupament d'una aplicació ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.6132810115814209, "description": "El document explica el desenvolupament d'un projecte de Treball Final de Grau, al Grau en Enginyeria Informàtica de la Universitat Politècnica de Catalunya. El projecte era, principalment, el desenvolupament d'una aplicació mòbil que, per cada ciutat, incentiva de forma lúdica l'ús dels seus espais verds creant àlbums amb dades proveïdes per les seves respectives plataformes de dades obertes. The document explains the development of a Bachelor's Degree Project, in Polytechnic University of Catalonia's Bachelor Degree in Informatics Engineering. The project mainly consists on the development of a mobile application that, for each smart city, incentivizes the use of its green areas playfully by creating albums with data provided by their respective open data platforms.", "keywords": "Mobile apps Aplicacions mòbils Zones verdes"},
{"title": "Dashboard per un estudi de les malalties NTDs", "url": "https://upcommons.upc.edu/handle/2117/394839", "author": "Herrera Caba, Júlia", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Com poder visualitzar de forma ràpida i senzilla el seguiment d'un projecte? L'equip del DTIM de la UPC està desenvolupant un projecte que a partir d'imatges de microscopi i intel·ligència artificial diagnostica de forma ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.6077032089233398, "description": "Com poder visualitzar de forma ràpida i senzilla el seguiment d'un projecte? L'equip del DTIM de la UPC està desenvolupant un projecte que a partir d'imatges de microscopi i intel·ligència artificial diagnostica de forma automatitzada la malària i altres malalties NTDs, i necessiten alguna manera de poder mostrar de forma senzilla i visual el punt en el qual es troben. El propòsit d'aquest treball és crear un dashboard que mostri diferents gràfics amb estadístiques que es poden extreure de la seva base de dades amb la informació que els investigadors envien sobre els organismes que han trobat en les imatges de les mostres de microscopi. How to visualize project monitoring quickly and easily? The UPC DTIM team is working on an application that uses microscope images and artificial intelligence to diagnose malaria and other NTDs. They require a solution that can visually and simply show the progress of their project. The objective of this project is to develop a dashboard that displays different graphs and statistics derived from their database that contain the information the data researchers submit regarding the organisms found in microscope images of observed samples.", "keywords": "Dashboards (Management information systems) Databases Dashboards (Gestió de sistemes d'informació) Bases de dades"},
{"title": "Integration of social values in a multi-agent platform running in a supercomputer", "url": "https://upcommons.upc.edu/handle/2117/394838", "author": "Bolea Pérez, David", "publisher": "Universitat Politècnica de Catalunya", "date": "2023-06-27", "rights": "Open Access", "abstract": "Agent-based modelling is one of the most suitable ways to simulate and analyse complex\r\nproblems and scenarios, especially those involving social interactions. Multi-agent systems, consisting\r\nof multiple agents in a ...", "depth": 1, "download_timeout": 180.0, "download_slot": "upcommons.upc.edu", "download_latency": 0.6910190582275391, "description": "Agent-based modelling is one of the most suitable ways to simulate and analyse complex\r\nproblems and scenarios, especially those involving social interactions. Multi-agent systems, consisting\r\nof multiple agents in a simulation environment, are widely used to understand emergent behaviour in\r\nvarious fields such as sociology, economics and policy.\r\nHowever, existing multi-agent platforms often face challenges in terms of scalability and\r\nreasoning capacity. Some platforms can scale well in terms of computation, but lack sophisticated\r\nreasoning mechanisms. On the other hand, some platforms employ complex reasoning systems, but\r\nthis can compromise their scalability.\r\nIn this work, we have extended an existing platform developed at UPC that enables scalable,\r\nparallel HTN planning for complex agents. Our main goal has been to improve the analysis of social\r\nrelationships between agents by incorporating moral values.\r\nBuilding on previous work done by David Marín on the implementation of the platform, we\r\nhave made extensions and modifications both formally and in the implementation. We have\r\nformalised the additions to the system model and provided an updated implementation.\r\nFinally, we have presented a complex example scenario that demonstrates all the additions we\r\nhave made. This scenario allows us to show how agents' preferences and moral values influence their\r\ndecisions and actions in a simulated environment. Through this work, we have sought to improve the\r\nexisting platform and fulfil the spirit and purpose of the platform.", "keywords": "Supercomputers Multiagent systems Supercomputadors Sistemes multiagent"}
]